cfg/Catalogs/ВидыПоощренийВзысканий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВидыПоощренийВзысканий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяПоощрением</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяВзысканием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УдержанияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Catalogs/ВидыПоощренийВзысканий/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Процедура ПриОткрытии()
	Если ЯвляетсяВзысканием <> Истина И ЯвляетсяПоощрением <> Истина Тогда
		ЯвляетсяПоощрением = Истина;
		ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

Процедура ЯвляетсяПоощрениемПриИзменении(Элемент)
	
	Если ЯвляетсяПоощрением Тогда
		ЯвляетсяВзысканием = Ложь;
	Иначе
		ЯвляетсяВзысканием = Истина;
	КонецЕсли;
	
	УстановитьТипВидаРасчета();
	
КонецПроцедуры

Процедура ЯвляетсяВзысканиемПриИзменении(Элемент)
	
	Если ЯвляетсяВзысканием Тогда
		ЯвляетсяПоощрением = Ложь;
	Иначе
		ЯвляетсяПоощрением = Истина;
	КонецЕсли;
	
	УстановитьТипВидаРасчета();
	
КонецПроцедуры

Процедура УстановитьТипВидаРасчета()
	Если ЯвляетсяПоощрением Тогда
		ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
	Иначе
		ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ПустаяСсылка();
	КонецЕсли;	
КонецПроцедуры
